nxp-mcuxpresso/mcux-soc-svd/MCXN947T/MCXN947T_cm33_core1.xml
        <register>
          <name>RAM_INTERLEAVE</name>
          <description>Control PKC RAM Interleave Access</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INTERLEAVE</name>
              <description>Controls PKC RAM access for PKC RAM 0 and PKC RAM 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RAM access to PKC RAM 0 and PKC RAM 1 is consecutive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERLEAVE</name>
                  <description>RAM access to PKC RAM 0 and PKC RAM 1 is interleaved. This setting is need for PKC L0 memory access.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC0CLKSEL</name>
          <description>DAC0 Functional Clock Selection</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Selects the DAC clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_0x0</name>
                  <description>No clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x1</name>
                  <description>PLL0 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x2</name>
                  <description>Clk_in</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x3</name>
                  <description>FRO_HF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x4</name>
                  <description>FRO_12M</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x5</name>
                  <description>PLL1_clk0 clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x6</name>
                  <description>No clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x7</name>
                  <description>No clock</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC0CLKDIV</name>
          <description>DAC0 functional clock divider</description>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock divider value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELEASED</name>
                  <description>Divider is not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STABLE</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>Clock frequency is not stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC1CLKSEL</name>
          <description>DAC1 Functional Clock Selection</description>
          <addressOffset>0x498</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Selects the DAC clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_0x0</name>
                  <description>No clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x1</name>
                  <description>PLL0 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x2</name>
                  <description>Clk_in</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x3</name>
                  <description>FRO_HF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x4</name>
                  <description>FRO_12M</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x5</name>
                  <description>PLL1_clk0 clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x6</name>
                  <description>No clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x7</name>
                  <description>No clock</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC1CLKDIV</name>
          <description>DAC1 functional clock divider</description>
          <addressOffset>0x49C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock divider value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELEASED</name>
                  <description>Divider is not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STABLE</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>Clock frequency is not stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC2CLKSEL</name>
          <description>DAC2 Functional Clock Selection</description>
          <addressOffset>0x4A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Selects the DAC clock source</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM_0x0</name>
                  <description>No clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x1</name>
                  <description>PLL0 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x2</name>
                  <description>Clk_in</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x3</name>
                  <description>FRO_HF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x4</name>
                  <description>FRO_12M</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x5</name>
                  <description>PLL1_clk0 clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x6</name>
                  <description>No clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM_0x7</name>
                  <description>No clock</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC2CLKDIV</name>
          <description>DAC2 functional clock divider</description>
          <addressOffset>0x4A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock divider value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELEASED</name>
                  <description>Divider is not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STABLE</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>Clock frequency is not stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FlexSPICLKSEL</name>
          <description>FlexSPI Clock Selection</description>
          <addressOffset>0x4A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Selects the FlexSPI clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENUM0</name>
                  <description>No clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM1</name>
                  <description>PLL0 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM2</name>
                  <description>No clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM3</name>
                  <description>FRO_HF</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM4</name>
                  <description>No clock</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM5</name>
                  <description>pll1_clock</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM6</name>
                  <description>USB PLL clock</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM7</name>
                  <description>No clock</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM8</name>
                  <description>No clock</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM9</name>
                  <description>No clock</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM10</name>
                  <description>No clock</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM11</name>
                  <description>No clock</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM12</name>
                  <description>No clock</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM13</name>
                  <description>No clock</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM14</name>
                  <description>No clock</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENUM15</name>
                  <description>No clock</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FlexSPICLKDIV</name>
          <description>FlexSPI Clock Divider</description>
          <addressOffset>0x4AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock divider value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RELEASED</name>
                  <description>Divider is not reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASSERTED</name>
                  <description>Divider is reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Divider clock is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>Divider clock is stopped</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNSTAB</name>
              <description>Divider status flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STABLE</name>
                  <description>Divider clock is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONGOING</name>
                  <description>Clock frequency is not stable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
