nxp-mcuxpresso/mcux-soc-svd/MCXN947T/MCXN947T_cm33_core1.xml
        <register>
          <name>MAC_EXT_CONFIGURATION</name>
          <description>MAC Extended Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPSL</name>
              <description>Giant Packet Size Limit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCRCC</name>
              <description>Disable CRC Checking for Received Packets</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>CRC Checking is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>CRC Checking is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPEN</name>
              <description>Slow Protocol Detection Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Slow Protocol Detection is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Slow Protocol Detection is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USP</name>
              <description>Unicast Slow Protocol Packet Detect</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unicast Slow Protocol Packet Detection is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unicast Slow Protocol Packet Detection is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDC</name>
              <description>Packet Duplication Control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Packet Duplication Control is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Packet Duplication Control is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIPGEN</name>
              <description>Extended Inter-Packet Gap Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Extended Inter-Packet Gap is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Extended Inter-Packet Gap is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIPG</name>
              <description>Extended Inter-Packet Gap</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_PACKET_FILTER</name>
          <description>MAC Packet Filter</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PR</name>
              <description>Promiscuous Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Promiscuous Mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Promiscuous Mode is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAIF</name>
              <description>DA Inverse Filtering</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DA Inverse Filtering is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DA Inverse Filtering is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PM</name>
              <description>Pass All Multicast</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Pass All Multicast is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Pass All Multicast is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBF</name>
              <description>Disable Broadcast Packets</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable Broadcast Packets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable Broadcast Packets</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCF</name>
              <description>Pass Control Packets</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLTR_ALL</name>
                  <description>MAC filters all control packets from reaching the application</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FW_XCPT_PAU</name>
                  <description>MAC forwards all control packets except Pause packets to the application even if they fail the address filter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FW_ALL</name>
                  <description>MAC forwards all control packets to the application even if they fail the address filter</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FW_PASS</name>
                  <description>MAC forwards the control packets that pass the Address filter</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VTFE</name>
              <description>VLAN Tag Filter Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>VLAN Tag Filter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>VLAN Tag Filter is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RA</name>
              <description>Receive All</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Receive All is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Receive All is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_WATCHDOG_TIMEOUT</name>
          <description>Watchdog Timeout</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WTO</name>
              <description>Watchdog Timeout</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bf_2KBYTES</name>
                  <description>2 KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_3KBYTES</name>
                  <description>3 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_4KBYTES</name>
                  <description>4 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_5KBYTES</name>
                  <description>5 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_6KBYTES</name>
                  <description>6 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_7KBYTES</name>
                  <description>7 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_8KBYTES</name>
                  <description>8 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_9KBYTES</name>
                  <description>9 KB</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_10KBYTES</name>
                  <description>10 KB</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_11KBYTES</name>
                  <description>11 KB</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_12KBYTES</name>
                  <description>12 KB</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_13KBYTES</name>
                  <description>13 KB</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_14KBYTES</name>
                  <description>14 KB</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_15KBYTES</name>
                  <description>15 KB</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bf_16383BYTES</name>
                  <description>16383 Bytes</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWE</name>
              <description>Programmable Watchdog Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Programmable Watchdog is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Programmable Watchdog is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
